HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPort_reg.h
/** \\brief  94, Port Output Modification Clear Register */
#define P32_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P32_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D280u)


/** \\brief  84, Port Output Modification Clear Register 4 */
#define P32_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D284u)


/** \\brief  4, Port Output Modification Register */
#define P32_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D204u)

/** \\brief  90, Port Output Modification Set Register */
#define P32_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P32_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D270u)


/** \\brief  74, Port Output Modification Set Register 4 */
#define P32_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D274u)


/** \\brief  0, Port Output Register */
#define P32_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D200u)


/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P32_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D240u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P33
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P33_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D3FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P33_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D3F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P33_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D350u)

/** \\brief  8, Identification Register */
#define P33_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D308u)

/** \\brief  24, Port Input Register */
#define P33_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D324u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P33_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D310u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P33_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D31Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P33_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D314u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P33_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D318u)

/** \\brief  94, Port Output Modification Clear Register */
#define P33_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D394u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P33_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D380u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P33_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D38Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P33_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D384u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P33_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D388u)

/** \\brief  4, Port Output Modification Register */
#define P33_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D304u)

/** \\brief  90, Port Output Modification Set Register */
#define P33_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D390u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P33_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D370u)

/** \\brief  7C, Port Output Modification Set Register 12 */
#define P33_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D37Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P33_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D374u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P33_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D378u)

/** \\brief  0, Port Output Register */
#define P33_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D300u)


/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P33_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D340u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P33_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D344u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P34
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P34_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D4FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P34_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D4F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P34_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D450u)

/** \\brief  8, Identification Register */
#define P34_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D408u)

/** \\brief  24, Port Input Register */
#define P34_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D424u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P34_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D410u)


/** \\brief  14, Port Input/Output Control Register 4 */
#define P34_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D414u)


/** \\brief  94, Port Output Modification Clear Register */
#define P34_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D494u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P34_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D480u)


/** \\brief  84, Port Output Modification Clear Register 4 */
#define P34_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D484u)


/** \\brief  4, Port Output Modification Register */
#define P34_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D404u)

/** \\brief  90, Port Output Modification Set Register */
#define P34_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D490u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P34_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D470u)


/** \\brief  74, Port Output Modification Set Register 4 */
#define P34_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D474u)


