HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxPort_reg.h
/** \\brief  0, Port Output Register */
#define P34_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D400u)


/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P34_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D440u)

/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P40
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P40_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003E0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P40_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003E0F8u)


/** \\brief  8, Identification Register */
#define P40_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003E008u)

/** \\brief  24, Port Input Register */
#define P40_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003E024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P40_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003E010u)


/** \\brief  14, Port Input/Output Control Register 4 */
#define P40_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003E014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P40_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003E018u)

/** \\brief  94, Port Output Modification Clear Register */
#define P40_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003E094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P40_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003E080u)


/** \\brief  84, Port Output Modification Clear Register 4 */
#define P40_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003E084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P40_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003E088u)

/** \\brief  4, Port Output Modification Register */
#define P40_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003E004u)

/** \\brief  90, Port Output Modification Set Register */
#define P40_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003E090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P40_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003E070u)


/** \\brief  74, Port Output Modification Set Register 4 */
#define P40_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003E074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P40_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003E078u)

/** \\brief  0, Port Output Register */
#define P40_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003E000u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P40_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003E060u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P40_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003E040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P40_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003E044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPORT_REG_H */
